USE DistrictPolyclinic
GO

DELETE FROM Specialization
DELETE FROM Office
DELETE FROM Medicinal_product

-- Filling out the "Specialization" table
BEGIN TRANSACTION sp
INSERT INTO Specialization VALUES
('01', N'Сімейний лікар'),
('02', N'Терапевт'),
('03', N'Педіатр'),
('04', N'Кардіолог'),
('05', N'Невролог'),
('06', N'Офтальмолог'),
('07', N'Отоларинголог (ЛОР)'),
('08', N'Дерматолог'),
('09', N'Ендокринолог'),
('10', N'Гастроентеролог'),
('11', N'Пульмонолог'),
('12', N'Уролог'),
('13', N'Гінеколог'),
('14', N'Хірург'),
('15', N'Травматолог'),
('16', N'Інфекціоніст'),
('17', N'Алерголог'),
('18', N'Ревматолог'),
('19', N'Психіатр'),
('20', N'Логопед'),
('21', N'Фізіотерапевт'),
('22', N'Стоматолог'),
('23', N'Онколог'),
('24', N'Імунолог'),
('25', N'Гематолог'),
('26', N'Нефролог'),
('27', N'Проктолог'),
('28', N'Мамолог'),
('29', N'Геронтолог'),
('30', N'Рентгенолог');


-- Filling the "Cabinet" table
BEGIN TRANSACTION office
INSERT INTO Office VALUES
('101', N'Кабінет сімейного лікаря', 1),
('102', N'Кабінет сімейного лікаря', 1),
('103', N'Кабінет терапевта', 1),
('104', N'Кабінет педіатра', 1),
('105', N'Кабінет огляду', 1),
('106', N'Кабінет кардіолога', 1),
('107', N'Кабінет офтальмолога', 1),
('108', N'Кабінет дерматолога', 1),
('109', N'Кабінет уролога', 1),
('110', N'Кабінет логопеда', 1),
('111', N'Універсальний кабінет', 1),
('112', N'Кабінет гастроентеролога', 1),
('113', N'Кабінет алерголога', 1),
('114', N'Кабінет ревматолога', 1),
('115', N'Кабінет ендокринолога', 1),
('201', N'Кабінет сімейного лікаря', 2),
('202', N'Кабінет пульмонолога', 2),
('203', N'Кабінет інфекціоніста', 2),
('204', N'Кабінет хірурга', 2),
('205', N'Кабінет гінеколога', 2),
('206', N'Кабінет мамолога', 2),
('207', N'Кабінет нефролога', 2),
('208', N'Кабінет геронтолога', 2),
('209', N'Кабінет фізіотерапевта', 2),
('210', N'Кабінет стоматолога', 2),
('211', N'Кабінет стоматолога', 2),
('212', N'Кабінет невролога', 2),
('213', N'Кабінет онколога', 2),
('214', N'Кабінет імунолога', 2),
('215', N'Кабінет психіатра', 2),
('216', N'Кабінет проктолога', 2),
('301', N'Кабінет рентгенолога', 3),
('302', N'Кабінет травматолога', 3),
('303', N'Кабінет ЛОРа', 3),
('304', N'Кабінет для медичних оглядів', 3),
('305', N'Кабінет гематолога', 3),
('306', N'Кабінет функціональної діагностики', 3),
('307', N'Кабінет сімейного лікаря', 3),
('308', N'Універсальний кабінет', 3),
('309', N'Універсальний кабінет', 3),
('310', N'Кабінет консультування', 3),
('311', N'Кабінет обстеження', 3),
('312', N'Кабінет обстеження', 3),
('313', N'Кабінет запасний', 3),
('314', N'Кабінет запасний', 3),
('315', N'Кабінет запасний', 3);

-- Filling in the "Medication" table
BEGIN TRANSACTION md
INSERT INTO Medicinal_product VALUES
('001', 'N02BE01', N'Парацетамол', N'Таблетки', N'мг', N'шт'),
('002', 'N02AA05', N'Кодеїн', N'Таблетки', N'мг', N'шт'),
('003', 'B01AC06', N'Ацетилсаліцилова кислота', N'Таблетки', N'мг', N'шт'),
('004', 'C09AA05', N'Еналаприл', N'Таблетки', N'мг', N'шт'),
('005', 'R03AC02', N'Сальбутамол', N'Аерозоль', N'мг', N'мл'),
('006', 'J01CA04', N'Амоксицилін', N'Капсули', N'мг', N'шт'),
('007', 'J01CR02', N'Амоксиклав', N'Таблетки', N'мг', N'шт'),
('008', 'A03FA01', N'Но-шпа (Дротаверин)', N'Таблетки', N'мг', N'шт'),
('009', 'A02BC05', N'Омепразол', N'Капсули', N'мг', N'шт'),
('010', 'A03AA03', N'Метоклопрамід', N'Ін’єкції', N'мг', N'мл'),
('011', 'C01DA14', N'Допамін', N'Інфузійний розчин', N'мг', N'мл'),
('012', 'C01CA01', N'Адреналін', N'Ін’єкції', N'мг', N'мл'),
('013', 'B05BB01', N'Розчин натрію хлориду', N'Розчин', N'мл', N'мл'),
('014', 'N05BA01', N'Діазепам', N'Ін’єкції', N'мг', N'мл'),
('015', 'J07BD52', N'Вакцина проти грипу', N'Вакцина', N'мл', N'доза'),
('016', 'N02BA01', N'Анальгін (Метамізол натрію)', N'Ін’єкції', N'мг', N'мл'),
('017', 'J01DB01', N'Цефазолін', N'Порошок для ін’єкцій', N'мг', N'флакон'),
('018', 'J01MA02', N'Ципрофлоксацин', N'Таблетки', N'мг', N'шт'),
('019', 'R05CB06', N'Ацетилцистеїн', N'Порошок для розчину', N'мг', N'пакет'),
('020', 'A11HA03', N'Ціанокобаламін (B12)', N'Ін’єкції', N'мг', N'мл'),
('021', 'A11CC05', N'Фолієва кислота', N'Таблетки', N'мг', N'шт'),
('022', 'A12BA01', N'Кальцію глюконат', N'Ін’єкції', N'мг', N'мл'),
('023', 'B05XA03', N'Рінгер-лактат', N'Розчин для інфузій', N'мл', N'мл'),
('024', 'N06AB10', N'Сертралін', N'Таблетки', N'мг', N'шт'),
('025', 'A03BB01', N'Атропін', N'Ін’єкції', N'мг', N'мл'),
('026', 'A10BA02', N'Метформін', N'Таблетки', N'мг', N'шт'),
('027', 'R06AE07', N'Цетиризин', N'Краплі', N'мг', N'мл'),
('028', 'R06AX27', N'Лоратадин', N'Таблетки', N'мг', N'шт'),
('029', 'C07AB02', N'Метопролол', N'Таблетки', N'мг', N'шт'),
('030', 'R03BB01', N'Іпратропію бромід', N'Аерозоль', N'мкг', N'мл'),
('031', 'A07DA03', N'Смекта (Діосмектит)', N'Порошок для суспензії', N'г', N'пакет'),
('032', 'A07EB01', N'Лоперамід', N'Капсули', N'мг', N'шт'),
('033', 'A07EA06', N'Ентерол', N'Капсули', N'мг', N'шт'),
('034', 'A02BC05', N'Омепразол', N'Капсули', N'мг', N'шт'),
('035', 'R03AK06', N'Сальбутамол', N'Інгалятор', N'мкг', N'доза'),
('036', 'B01AC06', N'Ацетилсаліцилова кислота', N'Таблетки', N'мг', N'шт'),
('037', 'C03CA01', N'Фуросемід', N'Ін’єкції', N'мг', N'мл'),
('038', 'C09AA05', N'Еналаприл', N'Таблетки', N'мг', N'шт'),
('039', 'C08CA01', N'Амлодипін', N'Таблетки', N'мг', N'шт'),
('040', 'A03FA01', N'Но-шпа (Дротаверин)', N'Таблетки', N'мг', N'шт'),
('041', 'A03FA01', N'Но-шпа (Дротаверин)', N'Ін’єкції', N'мг', N'мл'),
('042', 'J01CA04', N'Цефалексин', N'Капсули', N'мг', N'шт'),
('043', 'J01CR02', N'Амоксиклав', N'Порошок для суспензії', N'мг', N'мл'),
('044', 'J01FA10', N'Азитроміцин', N'Таблетки', N'мг', N'шт'),
('045', 'J01DD04', N'Цефтріаксон', N'Порошок для ін’єкцій', N'мг', N'флакон'),
('046', 'J01EE01', N'Ко-тримоксазол', N'Суспензія', N'мг', N'мл'),
('047', 'A10AB01', N'Інсулін короткої дії', N'Флакон', N'ОД', N'мл'),
('048', 'B05XA01', N'Натрію хлорид 0.9%', N'Розчин для інфузій', N'мл', N'мл'),
('049', 'V03AB32', N'Активоване вугілля', N'Таблетки', N'мг', N'шт'),
('050', 'N02BE01', N'Парацетамол', N'Сироп', N'мг', N'мл');


GO
COMMIT 
GO

GO
COMMIT
GO

GO
COMMIT
GO
